АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_НаименованиеТД/алк_НаименованиеТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_НаименованиеТД</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ГрадацииСечений/алк_ГрадацииСечений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ГрадацииСечений</name>
  <resources>
    <name>Градация</name>
    <type>
      <types>CatalogRef.Градации</types>
    </type>
  </resources>
  <dimensions>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ВидыТранспортировки/алк_ВидыТранспортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыТранспортировки</name>
  <enumValues>
    <name>Автомобильная</name>
  </enumValues>
  <enumValues>
    <name>Железнодорожная</name>
  </enumValues>
  <enumValues>
    <name>Теплоход</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/рфп_ОтгрузкаВагона/рфп_ОтгрузкаВагона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рфп_ОтгрузкаВагона</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНесортированного</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>НомерВагона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>_Производитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыВходящейОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазгруженСобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>_Пиловочник</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пиловочник</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>_Порода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>_Сорт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>_Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Catalogs/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>&lt;Без категории></description>
    </items>
    <items>
      <name>Карандаши</name>
      <description>Карандаши</description>
    </items>
    <items>
      <name>Кора</name>
      <description>Кора</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Опилки</name>
      <description>Опилки</description>
    </items>
    <items>
      <name>ОтходыПилмат</name>
      <description>Отходы производства пиломатериалов</description>
    </items>
    <items>
      <name>Пиловочник</name>
      <description>Пиловочник</description>
    </items>
    <items>
      <name>Пиломатериал</name>
      <description>Пиломатериал</description>
    </items>
    <items>
      <name>ПиломатериалСП</name>
      <description>Пиломатериал (СП)</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
    <items>
      <name>ШпонКусковой</name>
      <description>Шпон кусковой</description>
    </items>
    <items>
      <name>Щепа</name>
      <description>Щепа</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/РазмерСечения/РазмерСечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазмерСечения</name>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>ШиринаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолщинаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиаметрММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСечения</name>
    <type>
      <types>EnumRef.ВидыСечений</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/CommonModules/РфпСерверРегламентные/Module.bsl
#Область Последовательности

Процедура ВосстановитьПоследовательностьГП() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ГотоваяПродукция.Регистратор,
	|	алк_ГотоваяПродукция.Период КАК Период
	|ИЗ
	|	Последовательность.алк_ГотоваяПродукция КАК алк_ГотоваяПродукция
	|ГДЕ
	|	алк_ГотоваяПродукция.МоментВремени >= &МоментВремени
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("МоментВремени", Последовательности.алк_ГотоваяПродукция.ПолучитьГраницу());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Попытка
			
		Исключение
			//ОписаниеОшибки()
		КонецПопытки; 
		
		
	КонецЦикла;
	
	
	восстановили=истина;
	Для каждого э Из РезультатЗапроса Цикл
		
		попытка
			если э.Регистратор.проведен тогда
				э.Регистратор.ПолучитьОбъект().записать(РежимЗаписиДокумента.Проведение);
				#Если НаКлиенте Тогда
					Состояние("" + э.Регистратор);
				#КонецЕсли
			конецесли;
		исключение
			восстановили=ложь;
			#Если НаКлиенте Тогда
				сообщить("" + э.Регистратор + " Не проведен!!!",СтатусСообщения.Важное);
			#КонецЕсли
			
			прервать;
		конецпопытки;
		Последовательности.РФП_ГотоваяПродукция.УстановитьГраницу(э.Регистратор.МоментВремени());
		
	КонецЦикла;
	
КонецПроцедуры

Процедура алк_УстановкаДатыЗапрета() Экспорт
	
	Если Константы.алк_ДатаЗапретаРедактированияБиржа.Получить() <=  (ТекущаяДата() - 3600*24*3) Тогда
		
		Константы.алк_ДатаЗапретаРедактированияБиржа.Установить(ТекущаяДата() - 3600*24*3); 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


#Область Обмены

функция СоединениеС_ОПЕР_ИД()
	
	Ком = Новый COMобъект("V83.COMConnector");
	
	Попытка 
		
		Соединеине = Ком.Connect("Srvr='rfp01-srv062'; ref='oper_rfp'; usr='АдминРФП'; pwd='шташтшен9'");
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат Соединеине;
	
конецфункции

функция СоединениеС_ШПОН_ИД()
	
	Ком = Новый COMобъект("V83.COMConnector");
	
	Попытка 
		
		Соединеине = Ком.Connect("Srvr='rfp04-srv046'; ref='ALK_factory'; usr='АдминРФП'; pwd='шташтшен9'");
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат Соединеине;
	
конецфункции


Функция ПолучитьДанные_КомСоединение(СДаты) Экспорт
	
	СтруктураДанных = новый Структура("тВагоны, тАвто");
	
	Соединение = СоединениеС_ОПЕР_ИД();
	
	Если  Соединение = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет соединения с базой!";
		Сообщение.Сообщить(); 	
		
		Возврат Неопределено;
		
	Конецесли;
	
	Запрос = Соединение.NewObject("Запрос");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпецификацияЖДПродукция.Ссылка.Номер + ""В"" как Номер,
	|	СпецификацияЖДПродукция.Ссылка.Вагон КАК номерВагона,
	|	СпецификацияЖДПродукция.Ссылка.НомНакл КАК НомерНакладной,
	|	СпецификацияЖДПродукция.Ссылка.Сила КАК Сила,
	|	СпецификацияЖДПродукция.Ссылка.Дата КАК Дата,
	|	НАЧАЛОПЕРИОДА(СпецификацияЖДПродукция.Ссылка.Дата, НЕДЕЛЯ) КАК ДатаО,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Ссылка.Подрядчик) КАК Производитель,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Ссылка.СтанцияОтправления) КАК СтанцияОтправления,
	|	выбор когда СпецификацияЖДПродукция.Сортимент.Наименование ПОДОБНО ""%дрова%"" тогда
	|		""Ванино""
	|    иначе
	|    	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Ссылка.СтанцияНазначения) 
	|	конец КАК СтанцияНазначения,
	|	
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Сортимент) КАК Сортимент,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Порода) КАК Порода,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Порода.Длина) КАК Длина,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Сорт) КАК Сорт,
	|	СпецификацияЖДПродукция.Диаметр КАК Сечение,
	|	СпецификацияЖДПродукция.штук КАК Количество,
	|	СпецификацияЖДПродукция.Объем,
	|	0 КАК Толщина,
	|	0 КАК Ширина,
	|	СпецификацияЖДПродукция.Ссылка.Сертификат.Значение  как Сертификат
	|ИЗ
	|	Документ.СпецификацияЖД.Продукция КАК СпецификацияЖДПродукция
	|ГДЕ
	|	СпецификацияЖДПродукция.Ссылка.СтанцияНазначения.Наименование ПОДОБНО ""%Мылки%"" 
	|	И СпецификацияЖДПродукция.Ссылка.Дата >= &Дата
	|	И СпецификацияЖДПродукция.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СпецификацияЖДПродукция.Ссылка.Номер + ""В2"" как Номер,
	|	СпецификацияЖДПродукция.Ссылка.Вагон КАК номерВагона,
	|	СпецификацияЖДПродукция.Ссылка.НомНакл КАК НомерНакладной,
	|	СпецификацияЖДПродукция.Ссылка.Сила КАК Сила,
	|	СпецификацияЖДПродукция.Ссылка.Дата КАК Дата,
	|	НАЧАЛОПЕРИОДА(СпецификацияЖДПродукция.Ссылка.Дата, НЕДЕЛЯ) КАК ДатаО,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Ссылка.Подрядчик) КАК Производитель,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Ссылка.СтанцияОтправления) КАК СтанцияОтправления,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Ссылка.СтанцияНазначения) КАК СтанцияНазначения,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Сортимент) КАК Сортимент,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Порода) КАК Порода,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Порода.Длина) КАК Длина,
	|	ПРЕДСТАВЛЕНИЕ(СпецификацияЖДПродукция.Сорт) КАК Сорт,
	|	СпецификацияЖДПродукция.Диаметр КАК Сечение,
	|	СпецификацияЖДПродукция.штук КАК Количество,
	|	СпецификацияЖДПродукция.Объем,
	|	0 КАК Толщина,
	|	0 КАК Ширина,
	|	0 как Сертификат //СпецификацияЖДПродукция.Ссылка.Сертификат.Значение  как Сертификат
	|ИЗ
	|	Документ.СпецификацияЖД2.Продукция КАК СпецификацияЖДПродукция
	|ГДЕ
	|	  СпецификацияЖДПродукция.Ссылка.СтанцияНазначения.Наименование ПОДОБНО ""%Мылки%""
	|	И СпецификацияЖДПродукция.Ссылка.Дата >= &Дата
	|	И СпецификацияЖДПродукция.Ссылка.Проведен
	|упорядочить по Дата";
	
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(СДаты), СДаты, ТекущаяДата() - 3600*60*10));	//за 10 дней
	
	тВагоны = ЗначениеИзСтрокиВнутр(Соединение.ЗначениеВСтрокуВнутр(Запрос.Выполнить().Выгрузить()));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияКруглогоПродукция.Ссылка.Номер + ""В3"" как Номер,
	|	РеализацияКруглогоПродукция.Ссылка.Дата как Дата,
	|	НАЧАЛОПЕРИОДА(РеализацияКруглогоПродукция.Ссылка.Дата, НЕДЕЛЯ) КАК ДатаО,
	|	представление(РеализацияКруглогоПродукция.Ссылка.Подрядчик) как Производитель,
	|	представление(РеализацияКруглогоПродукция.Ссылка.Подрядчик) как СтанцияОтправления,
	|	""Мылки"" КАК СтанцияНазначения,
	|	РеализацияКруглогоПродукция.Ссылка.НомНакл как НомерНакладной,
	|	РеализацияКруглогоПродукция.Ссылка.НомАвто КАК номерВагона,
	|	представление(РеализацияКруглогоПродукция.Ссылка.Сертификат.Значение) как Сертификат,
	|	представление(РеализацияКруглогоПродукция.Порода) как Порода,
	|	представление(РеализацияКруглогоПродукция.Сорт) как Сорт,
	|	РеализацияКруглогоПродукция.Порода.Длина как Длина,
	|	РеализацияКруглогоПродукция.Диаметр как Сечение,
	|	РеализацияКруглогоПродукция.штук как Количество,
	|	РеализацияКруглогоПродукция.Объем,
	|	представление(РеализацияКруглогоПродукция.Сортимент) как Сортимент,
	|	представление(РеализацияКруглогоПродукция.Ссылка.Грузополучатель) как Грузополучатель,
	|   0 как Сила
	|ИЗ
	|	Документ.РеализацияКруглого.Продукция КАК РеализацияКруглогоПродукция
	|ГДЕ
	|	РеализацияКруглогоПродукция.Ссылка.Проведен
	|	И РеализацияКруглогоПродукция.Ссылка.Грузополучатель.Наименование ПОДОБНО ""%Амурская%""
	|	И РеализацияКруглогоПродукция.Ссылка.Дата >= &Дата
	|упорядочить по Дата";
	
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(СДаты), СДаты, ТекущаяДата() - 3600*60*10));	//за 10 дней	
	
	тАвто = ЗначениеИзСтрокиВнутр(Соединение.ЗначениеВСтрокуВнутр(Запрос.Выполнить().Выгрузить()));
	
	СтруктураДанных.тВагоны = тВагоны;
	СтруктураДанных.тАвто   = тАвто;
	
	Возврат СтруктураДанных;
	
КонецФункции

Процедура ЗагрузитьДокументы_рфп_ОтгрузкаВагона(ЗагружаемыеДокументы) Экспорт
	
	Если ТипЗнч(ЗагружаемыеДокументы) <> Тип("Структура") Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	табДанных.Дата,
	|	табДанных.ДатаО,
	|	табДанных.Длина,
	|	табДанных.Количество,
	|	табДанных.Номер,
	|	табДанных.НомерНакладной,
	|	табДанных.Объем,
	|	табДанных.Порода,
	|	табДанных.Производитель,
	|	табДанных.Сертификат,
	|	табДанных.Сечение,
	|	табДанных.Сила,
	|	табДанных.Сорт,
	|	табДанных.Сортимент,
	|	табДанных.СтанцияНазначения,
	|	табДанных.СтанцияОтправления,
	//|	табДанных.Толщина,
	//|	табДанных.Ширина,
	|	табДанных.НомерВагона
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	&табДанных КАК табДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Дата КАК Дата,
	|	втДанные.ДатаО КАК ДатаО,
	|	втДанные.Длина,
	|	втДанные.Количество КАК Количество,
	|	втДанные.Номер КАК Номер,
	|	ВЫРАЗИТЬ(втДанные.НомерНакладной КАК СТРОКА(100)) КАК НомерНакладной,
	|	втДанные.Объем КАК Объем,
	|	втДанные.Порода,
	|	ВЫРАЗИТЬ(втДанные.Производитель КАК СТРОКА(100)) КАК Производитель,
	|	втДанные.Сертификат КАК Сертификат,
	|	втДанные.Сечение,
	|	втДанные.Сила КАК Сила,
	|	втДанные.Сорт,
	|	втДанные.Сортимент,
	|	ВЫРАЗИТЬ(втДанные.СтанцияНазначения КАК СТРОКА(100)) КАК СтанцияНазначения,
	|	ВЫРАЗИТЬ(втДанные.СтанцияОтправления КАК СТРОКА(100)) КАК СтанцияОтправления,
	//|	втДанные.Толщина,
	//|	втДанные.Ширина,
	|	втДанные.НомерВагона КАК НомерВагона
	|ИЗ
	|	втДанные КАК втДанные
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Объем)
	|ПО
	|	Номер";
	
	
	Если ЗагружаемыеДокументы.Свойство("тВагоны") Тогда
		
		Запрос.УстановитьПараметр("табДанных", ЗагружаемыеДокументы.тВагоны);
		ЗагрузитьПоЗапросу(Запрос);
		
	КонецЕсли;
	
	Если ЗагружаемыеДокументы.Свойство("тАвто")  Тогда 
		
		Запрос.УстановитьПараметр("табДанных", ЗагружаемыеДокументы.тАвто);
		ЗагрузитьПоЗапросу(Запрос);
		
	КонецЕсли;
	
КонецПроцедуры // ЗагрузитьДокументы_рфп_ОтгрузкаВагона

Процедура ЗагрузитьПоЗапросу(Запрос)
	
	КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Пиловочник;
	Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(КатегорияНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ВыборкаНомер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Пока ВыборкаНомер.Следующий() Цикл
		
		
		// Нач мод [Пакушев И.С.] [27.06.2018] 
		// Обращение № [0000092200] [номера уникальны только в течени года, просходит дублирование номеров и затираются старые документы]
		// Было 
		//НайденыйДокумент = Документы.рфп_ОтгрузкаВагона.НайтиПоНомеру(ВыборкаНомер.Номер);
		// Стало
				
		
		Запрос1 = Новый Запрос;
		Запрос1.Текст = 
		"ВЫБРАТЬ
		|	рфп_ОтгрузкаВагона.Ссылка
		|ИЗ
		|	Документ.рфп_ОтгрузкаВагона КАК рфп_ОтгрузкаВагона
		|ГДЕ
		|	рфп_ОтгрузкаВагона.Номер = &Номер
		|	И рфп_ОтгрузкаВагона.Дата > ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -60)";
		
		Запрос1.УстановитьПараметр("Дата", 	ТекущаяДата());
		Запрос1.УстановитьПараметр("Номер", 	ВыборкаНомер.Номер);
		
		РезультатЗапроса1 = Запрос1.Выполнить();
		
		ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
		
		НайденыйДокумент = Документы.рфп_ОтгрузкаВагона.ПустаяСсылка();
		
		Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
			НайденыйДокумент = ВыборкаДетальныеЗаписи1.Ссылка;
		КонецЦикла;	
		
		// Кон мод [Пакушев И.С.] [27.06.2018]

		
		Если НайденыйДокумент = Документы.рфп_ОтгрузкаВагона.ПустаяСсылка() Тогда
			
			НовыйДокумент = Документы.рфп_ОтгрузкаВагона.СоздатьДокумент();
			НовыйДокумент.Номер = ВыборкаНомер.Номер;
			
		Иначе
			
			НовыйДокумент = НайденыйДокумент.ПолучитьОбъект();
			
		КонецЕсли;
		
		тчПиловочник = НовыйДокумент.Пиловочник;
		тчПиловочник.Очистить();
		
		ВыборкаДетальныеЗаписи = ВыборкаНомер.Выбрать();
		
		Первая = Истина;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если Первая Тогда
				НовыйДокумент.Дата = ВыборкаДетальныеЗаписи.Дата;
				НовыйДокумент.НомерВагона = ВыборкаДетальныеЗаписи.НомерВагона;
				НовыйДокумент.НомерНакладной = ВыборкаДетальныеЗаписи.НомерНакладной;
				
				НовыйДокумент._Производитель = ВыборкаДетальныеЗаписи.Производитель;
				НовыйДокумент.Производитель = РфпПолучениеДанныхСервер.Производитель_по_рфпПроизводитель(ВыборкаДетальныеЗаписи.Производитель);
				Первая = Ложь;	
			КонецЕсли;
			
			НоваяСтрока = тчПиловочник.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			
			ПородаДлина = РфпПолучениеДанныхСервер.ПородаДлина_по_рфпПорода(ВыборкаДетальныеЗаписи.Порода);
			НоваяСтрока.Порода = ПородаДлина.Порода;
			НоваяСтрока._Порода = ВыборкаДетальныеЗаписи.Порода;
			НоваяСтрока.Длина  = ПородаДлина.Длина;
			НоваяСтрока._Длина  = ВыборкаДетальныеЗаписи.Длина;
			
			НоваяСтрока.Сечение = Справочники.РазмерСечения.НайтиПоРеквизиту("ДиаметрММ", ВыборкаДетальныеЗаписи.Сечение * 10, , КатегорияНоменклатуры);
			
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество;
			НоваяСтрока.Объем      = ВыборкаДетальныеЗаписи.Объем;
			
			НоваяСтрока._Сорт      = ВыборкаДетальныеЗаписи.Сорт;
			Сорт = РфпПолучениеДанныхСервер.Сорт_по_рфпСорт(ВыборкаДетальныеЗаписи.Сорт);
			НоваяСтрока.Сорт       = Сорт;
			
		КонецЦикла;
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		Исключение 		
			Сообщить(ОписаниеОшибки());			
		КонецПопытки; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура алк_ЗапретЗаписиПоГлобальнойДатеПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не (РольДоступна("алк_РаботаВЗакрытомПериоде") И 
		(ТипЗнч(Источник) = Тип("ДокументОбъект.алк_ТранспортировкаЗапасов")) Или
		ТипЗнч(Источник) = Тип("ДокументОбъект.алк_ЗаказПокупателя")) Тогда
		
		Если НачалоДня(Источник.Дата) <= Константы.алк_ГлобальнаяДатаЗакрытияПериода.Получить() Тогда
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Период закрыт!";
			Сообщение.Сообщить(); 
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры


////////////////////////////////////////////// Получение данных по отходам ////////////////////////////////////////////

Функция ПолучитьДанные_КомСоединение_ОтходыШпона() Экспорт
	
	СтруктураДанных = новый Структура("Тест", "ОК");
	
	Соединение = СоединениеС_ШПОН_ИД();
	
	Если  Соединение = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет соединения с базой!";
		Сообщение.Сообщить(); 	
		
		Возврат Неопределено;
		
	Конецесли;
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти 


#Область ВыгрузкиРегламентные

Процедура алк_ВыгрузкаОтгрузок(ДатаОт = "") Экспорт
	
	Если ДатаОт = "" Тогда
		ДатаОт = ТекущаяДата() - 3600*24*30;	
	КонецЕсли; 
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Номенклатура) КАК Товар,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Порода) КАК Порода,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.КатегорияНоменклатуры = ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.ШпонКусковой)
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.ВесНетто
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Объем,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Железнодорожная)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЖД,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Автомобильная)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Авто,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД КАК ДатаОП,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000) КАК Длина,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК Количество,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.НомерНакладной,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС КАК НомерВагона,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер КАК НомерОП,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ) КАК Толщина,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ШиринаММ) КАК Ширина,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК СкладПолучательСсылка,
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель) КАК СкладПолучатель,
	|	алк_ПараметрыХарактеристик.Влажность,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат.НомерСертификата КАК НомерСертификата,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер.Представление,
	|	NULL КАК Поле1
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ТранспортировкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Проведен
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата >= &ДатаОт
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВыгружатьВ_ТД
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОтгрузкаЩепыЗапасы.Номенклатура),
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Порода),
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт),
	|	ВЫБОР
	|		КОГДА алк_ОтгрузкаЩепыЗапасы.Ссылка.Дата >= &ДатаПереходаКОтгрузкеПоОбъемуЩепа
	|				И НЕ алк_ОтгрузкаЩепыЗапасы.Ссылка.Комментарий ПОДОБНО &КлючевоеСлово
	|			ТОГДА алк_ОтгрузкаЩепыЗапасы.ОбъемТаможня
	|		ИНАЧЕ алк_ОтгрузкаЩепыЗапасы.ВесНетто
	|	КОНЕЦ,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка.ДатаКУчету_ТД,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000),
	|	1,
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка.НомерНакладной,
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка.ИдентификаторТС,
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Номер,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ),
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ШиринаММ),
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОтгрузкаЩепыЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель),
	|	алк_ПараметрыХарактеристик.Влажность,
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Сертификат.НомерСертификата,
	|	алк_ОтгрузкаЩепыЗапасы.ОбъемТаможня,
	|	алк_ОтгрузкаЩепыЗапасы.ВесНетто,
	|	алк_ОтгрузкаЩепыЗапасы.ВесБрутто,
	|	NULL,
	|	""Щепа""
	|ИЗ
	|	Документ.алк_ОтгрузкаЩепы.Запасы КАК алк_ОтгрузкаЩепыЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ОтгрузкаЩепыЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Проведен
	|	И алк_ОтгрузкаЩепыЗапасы.Ссылка.Дата >= &ДатаОт
	|	И алк_ОтгрузкаЩепыЗапасы.Ссылка.ВыгружатьВ_ТД
	|	И алк_ОтгрузкаЩепыЗапасы.Ссылка.ДатаКУчету_ТД <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	
	Запрос.УстановитьПараметр("ДатаОт", ДатаОт);
	Запрос.УстановитьПараметр("ДатаПереходаКОтгрузкеПоОбъемуЩепа", Дата('2018.06.01 00:00:00'));
	Запрос.УстановитьПараметр("КлючевоеСлово", "%Баржа%");
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Результат = РезультатЗапроса.Выгрузить();	
	Результат.Колонки.Добавить("УИД");
	
	Гр = Справочники.Влажность.НайтиПоКоду("000000001");
	
	Для каждого стрРезультат Из Результат Цикл
		
		стрРезультат.УИД = стрРезультат.Ссылка.УникальныйИдентификатор();
		
		Отбор = Новый Структура("Объект", стрРезультат.СкладПолучательСсылка);		
		тзНаименование = РегистрыСведений.алк_НаименованиеТД.СрезПоследних( , Отбор); 
		
		Если тзНаименование.Количество() <> 0 Тогда
			стрРезультат.СкладПолучатель = тзНаименование[0].Наименование;
		Иначе
			стрРезультат.СкладПолучатель = стрРезультат.СкладПолучатель;
		КонецЕсли; 
		
		Если стрРезультат.Товар = "Карандаш" Тогда
			
			стрРезультат.Товар = "Карандаши"; 
			
		КонецЕсли; 
		
		
		Если стрРезультат.Товар = "Пиломатериал" Тогда
			
			Если стрРезультат.Влажность = Гр Тогда
				
				//стрРезультат.Сорт = стрРезультат.Сорт + " Gr"; 
				
			Иначе
				
				стрРезультат.Сорт = стрРезультат.Сорт + " KD";
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 
		
	ЗначениеВФайл("\\rfp01-srv023\Files\1C\Exchange\ALK_TD\ALK_OT_TD_1.txt", Результат);
	
КонецПроцедуры

Процедура алк_ВыгрузкаПриемкиЛП() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Номер,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Партия.Номер КАК НомерОгрузки,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата,
	|	НАЧАЛОПЕРИОДА(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата, ДЕНЬ) КАК Дата2,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.ДатаОтгрузки,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Производитель) КАК Производитель,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.НомерНакладной,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.НомерВагона,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.СтанцияОтправления) КАК СтанцияОтправления,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.СертификатПроизводителя.НомерСертификата КАК Сертификат,
	|	ВЫБОР
	|		КОГДА алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель.Несоответствие
	|			ТОГДА ""несоответствие""
	|		ИНАЧЕ ""основной склад""
	|	КОНЕЦ КАК Штабель,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Номенклатура,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Порода,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сорт) КАК Сорт,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Длина,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сечение.ДиаметрММ,
	|	ПРЕДСТАВЛЕНИЕ(алк_ГрадацииСечений.Градация) КАК Градация,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Количество,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Объем,
	|	0 КАК ОбъемСПрипуском,
	|	ИСТИНА КАК МылкиЛП,
	|	ВЫБОР
	|		КОГДА алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Автомобильная)
	|			ТОГДА ""Автомобиль""
	|		ИНАЧЕ ""Вагон""
	|	КОНЕЦ КАК Транспорт,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель.Ссылка
	|ИЗ
	|	Документ.алк_ПриемкаЛесопродукции.ПиловочникГОСТ КАК алк_ПриемкаЛесопродукцииПиловочникГОСТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрадацииСечений КАК алк_ГрадацииСечений
	|		ПО алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сечение = алк_ГрадацииСечений.Сечение
	|ГДЕ
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Проведен
	|	И алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата >= &ДатаОт
	|	И НЕ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Основная";
	
	Запрос.УстановитьПараметр("ДатаОт", ТекущаяДата() - 3600*24*35);
	//Запрос.УстановитьПараметр("ДатаОт", СДаты);
	
	
	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить()
	
	ТаблицаРезультат = РезультатЗапроса.Выгрузить();
	ТаблицаРезультат.Колонки.Добавить("Товар");
	ТаблицаРезультат.Колонки.Добавить("Сечение");
	
	Для Каждого стрТаблицы Из ТаблицаРезультат Цикл
		
		СтрНомер = стрТаблицы.Номер;
		
		СтрНомер = "ЛК-" + Прав(СтрНомер, СтрДлина(СтрНомер)-3);
		
		стрТаблицы.Номер = СтрНомер;
		стрТаблицы.Товар = стрТаблицы.Порода.СокращенноеНаименование + " " + СтрЗаменить(стрТаблицы.Длина.Наименование, ".", ",");
		стрТаблицы.Сечение = ?(стрТаблицы.СечениеДиаметрММ >= 100, Строка(стрТаблицы.СечениеДиаметрММ / 10), "0" + Строка(стрТаблицы.СечениеДиаметрММ / 10));
		
	КонецЦикла; 
	
	ТаблицаРезультат = ОбозначитьШтРеквизитКакОсновной(ТаблицаРезультат);
	
	ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["Порода"]);	
	ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["Длина"]);
	ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["Номенклатура"]);
	ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["СечениеДиаметрММ"]);
	
	ЗначениеВФайл("\\rfp01-srv023\Files\1C\Exchange\ALK_TD\ALK_TD_L.txt", ТаблицаРезультат);
	
КонецПроцедуры

Функция ОбозначитьШтРеквизитКакОсновной(ОбрабатываемаяТаблица)
	
	ШтабельРеквизит = Справочники.алк_Штабели.НайтиПоКоду("000000007");
	
	Для Каждого стрТаблицы Из ОбрабатываемаяТаблица Цикл
		Если стрТаблицы.ШтабельСсылка = ШтабельРеквизит Тогда
			стрТаблицы.Штабель = "основной склад"; 	
		КонецЕсли; 	
		
	КонецЦикла;
	
	Возврат ОбрабатываемаяТаблица;
	
КонецФункции

#КонецОбласти 


#Область ЗагрузкиРегламентыные

Процедура алкЗагрузкаРапортовШпон() Экспорт
	
	//Для й = 1 По 3 Цикл
	//	
	//	Если й = 1 Тогда
	//		
	//		тРапортаЛущение = новый ТаблицаЗначений;
	//		
	//		Попытка
	//			
	//			тРапортаЛущение = ЗначениеИзФайла("\\rfp01-srv023\Files\1C\Exchange\ALK_ALogK\ALK_TO_ALogK_Raport1.txt");
	//			
	//		Исключение
	//			
	//			Продолжить;
	//			
	//		Конецпопытки;
	//		
	//		Если тРапортаЛущение.Количество() = 0 Тогда
	//			
	//			Возврат;
	//			
	//		КонецЕсли; 
	//		
	//		Для каждого стрРапорт Из тРапортаЛущение Цикл
	//			
	//			НеобходимаяСсылка = Документы.рфп_РапортЛущение.ПолучитьСсылку(Новый УникальныйИдентификатор(стрРапорт.УИД));
	//			
	//			Если НеобходимаяСсылка.ПолучитьОбъект() <> Неопределено Тогда
	//				
	//				ОбъектРапорт = НеобходимаяСсылка.ПолучитьОбъект();
	//				
	//			Иначе
	//				
	//				ОбъектРапорт = Документы.рфп_РапортЛущение.СоздатьДокумент();
	//				
	//				ОбъектРапорт.УстановитьСсылкуНового(НеобходимаяСсылка);
	//				
	//			КонецЕсли; 
	//			
	//			ОбъектРапорт.Дата = стрРапорт.Дата;
	//			ОбъектРапорт.Номер = стрРапорт.Номер;
	//			ОбъектРапорт.ДатаСмены = стрРапорт.ДатаСмены;
	//			ОбъектРапорт.Смена = ?(стрРапорт.Смена = "день", Перечисления.Смены.смена_8_20, Перечисления.Смены.смена_20_8);
	//			
	//			ОбъектРапорт.ОбъемЩепы = стрРапорт.Объем;
	//			
	//			Попытка
	//				ОбъектРапорт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//			Исключение
	//				//ОписаниеОшибки()
	//			КонецПопытки; 
	//			
	//		КонецЦикла;	 
	//		
	//	ИначеЕсли й = 2  Тогда 
	//		
	//		тРапортаРебро = новый ТаблицаЗначений;
	//		
	//		Попытка
	//			
	//			тРапортаРебро = ЗначениеИзФайла("\\rfp01-srv023\Files\1C\Exchange\ALK_ALogK\ALK_TO_ALogK_Raport2.txt");
	//			
	//		Исключение
	//			
	//			Возврат;
	//			
	//		Конецпопытки;
	//		
	//		Если тРапортаРебро.Количество() = 0 Тогда
	//			
	//			Продолжить;
	//			
	//		КонецЕсли; 
	//		
	//		Для каждого стрРапорт Из тРапортаРебро Цикл
	//			
	//			НеобходимаяСсылка = Документы.рфп_РапортРебросклей.ПолучитьСсылку(Новый УникальныйИдентификатор(стрРапорт.УИД));
	//			
	//			Если НеобходимаяСсылка.ПолучитьОбъект() <> Неопределено Тогда
	//				
	//				ОбъектРапорт = НеобходимаяСсылка.ПолучитьОбъект();
	//				
	//			Иначе
	//				
	//				ОбъектРапорт = Документы.рфп_РапортРебросклей.СоздатьДокумент();
	//				
	//				ОбъектРапорт.УстановитьСсылкуНового(НеобходимаяСсылка);
	//				
	//			КонецЕсли; 
	//			
	//			ОбъектРапорт.Дата = стрРапорт.Дата;
	//			ОбъектРапорт.Номер = стрРапорт.Номер;
	//			ОбъектРапорт.ДатаСмены = стрРапорт.ДатаСмены;
	//			ОбъектРапорт.Смена = ?(стрРапорт.Смена = "день", Перечисления.Смены.смена_8_20, Перечисления.Смены.смена_20_8);
	//			ОбъектРапорт.ОбъемЩепы = стрРапорт.Объем;
	//			
	//			Попытка
	//				ОбъектРапорт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//			Исключение
	//				//ОписаниеОшибки()
	//			КонецПопытки; 
	//			
	//		КонецЦикла;
	//		
	//	ИначеЕсли й = 3  Тогда 
	//		
	//		тРапортаОкорка = новый ТаблицаЗначений;
	//		
	//		Попытка
	//			
	//			тРапортаОкорка = ЗначениеИзФайла("\\rfp01-srv023\Files\1C\Exchange\ALK_ALogK\ALK_TO_ALogK_Raport3.txt");
	//			
	//		Исключение
	//			
	//			Возврат;
	//			
	//		Конецпопытки;
	//		
	//		Если тРапортаОкорка.Количество() = 0 Тогда
	//			
	//			Продолжить;
	//			
	//		КонецЕсли; 
	//		
	//		Для каждого стрРапорт Из тРапортаОкорка Цикл
	//			
	//			НеобходимаяСсылка = Документы.рфп_РапортОкорка.ПолучитьСсылку(Новый УникальныйИдентификатор(стрРапорт.УИД));
	//			
	//			Если НеобходимаяСсылка.ПолучитьОбъект() <> Неопределено Тогда
	//				
	//				ОбъектРапорт = НеобходимаяСсылка.ПолучитьОбъект();
	//				
	//			Иначе
	//				
	//				ОбъектРапорт = Документы.рфп_РапортОкорка.СоздатьДокумент();
	//				
	//				ОбъектРапорт.УстановитьСсылкуНового(НеобходимаяСсылка);
	//				
	//			КонецЕсли; 
	//			
	//			ОбъектРапорт.Дата = стрРапорт.Дата;
	//			ОбъектРапорт.Номер = стрРапорт.Номер;
	//			ОбъектРапорт.ДатаСмены = стрРапорт.ДатаСмены;
	//			ОбъектРапорт.Смена = ?(стрРапорт.Смена = "день", Перечисления.Смены.смена_8_20, Перечисления.Смены.смена_20_8);
	//			ОбъектРапорт.ОбъемКоры = стрРапорт.Объем;
	//			
	//			Попытка
	//				ОбъектРапорт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//			Исключение
	//				//ОписаниеОшибки()
	//			КонецПопытки; 
	//			
	//		КонецЦикла;
	//		
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла; 	
	
КонецПроцедуры

Процедура алкЗагрузкаДанныхОпербаз() Экспорт
	
	Данные = РфпСерверРегламентные.ПолучитьДанные_КомСоединение(ТекущаяДата() - 24*3600*10);	
	
	Если Данные = Неопределено Тогда
		
		Возврат;
		
	Конецесли;
	
	тВагоны = Данные.тВагоны;
	тАвто   = Данные.тАвто;
	
	Если твагоны.Количество() = 0 и тАвто.Количество() = 0 Тогда
		
		Возврат;
		
	Конецесли;
	
	РфпСерверРегламентные.ЗагрузитьДокументы_рфп_ОтгрузкаВагона(Данные);	
	
КонецПроцедуры

#КонецОбласти 

Процедура Конец()		
КонецПроцедуры

Процедура РФП_ОбменERP() Экспорт
	
	Если РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() тогда
                Возврат;
	КонецЕсли;
	
	ФайлПравил = "\\rfp01-srv023.rfpgroup.ru\Files\1C\exchange\ALogistiK_ERP\rule\ALogistiK_ERP_rule.xml";
	ФайлЗагрузки = "\\rfp01-srv023.rfpgroup.ru\Files\1C\exchange\ALogistiK_ERP\ALogistiK_ERP.xml";
	ФайлОбмена = КаталогВременныхФайлов() + "ALogistiK_" + Формат(ТекущаяДата(),  "ДФ=yyyy-MM-dd-чч-мм-сс") + ".xml";
	ФайлПротоколаОбмена = "\\rfp01-srv023.rfpgroup.ru\Files\1C\exchange\ALogistiK_ERP\Log\" + Формат(ТекущаяДата(),  "ДФ=yyyy_MM_dd") + ".txt";
	ИмяСобытияЖР = "ОбменДанными.ALogistiK.ERP";	
	УзелОбмена = ПланыОбмена.РФП_AlogistK_ERP.НайтиПоКоду("ЕРП");
	
	Попытка	
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация,,"Начало выгрузки в ERP");
		
		//Проверка отсутствия файла выгрузки и наличие файла правил выгрузки
		ФайлНаДиске = Новый Файл(ФайлЗагрузки);
    	Если ФайлНаДиске.Существует() Тогда
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Предупреждение,,"Файл выгрузки не удален базой ЕРП", "Файл по адресу: "+ФайлЗагрузки+" не удален базой ЕРП. Выгрузка прервана, ожидается что файла не будет");
			Возврат;
    	КонецЕсли;
		ФайлНаДиске = Новый Файл(ФайлПравил);
    	Если не ФайлНаДиске.Существует() Тогда
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Предупреждение,,"Файл правил выгрузки не найден", "Файл по адресу: "+ФайлПравил+" не существут. Выгрузка прервана");
			Возврат;
    	КонецЕсли;
		
		//Заполнения параметров обмена
		Обработка = Обработки.УниверсальныйОбменДаннымиXML.Создать();
		//МакетПравилОбмена              = //ПланыОбмена.ОБ_ERP.ПолучитьМакет("ПравилаОбменаOB_ERP");
		//ИмяВременногоФайлаПравилОбмена = КаталогВременныхФайлов() + СокрЛП(Формат(ТекущаяДата(),"ДФ=ddMMyyyyhhmmss")) + ".xml";
		//МакетПравилОбмена.Записать(ИмяВременногоФайлаПравилОбмена);
		Обработка.ИмяФайлаПравилОбмена = ФайлПравил;
		
		Обработка.РежимОбмена 								 = "Выгрузка";
		Обработка.ВыводВОкноСообщенийИнформационныхСообщений = Ложь;	
		Обработка.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки = 1; 
		Обработка.ЗагружатьДанныеВРежимеОбмена 				 = Истина;
		Обработка.ЗаписыватьРегистрыНаборамиЗаписей 		 = Истина;
		
		Обработка.ИмяФайлаПротоколаОбмена 				= ФайлПротоколаОбмена;
		Обработка.ДописыватьДанныеВПротоколОбмена 		= Истина;
		Обработка.ВыводВПротоколИнформационныхСообщений = Ложь;
		Обработка.ВыводВПротоколСообщенийОбОшибках 		= Истина;
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ФайлОбмена, "UTF-8");
		ЗаписьXML.Закрыть();
		
		Обработка.ИмяФайлаОбмена = ФайлОбмена;
		
		Обработка.ЗагрузитьПравилаОбмена();
		
		ВременнаяТаблицаПравил = Обработка.ТаблицаПравилВыгрузки.Скопировать();
		
		Для каждого ПервыйУровень Из ВременнаяТаблицаПравил.Строки Цикл
			Если ПервыйУровень.ЭтоГруппа тогда
				Для Каждого СтрокаУровня Из ВременнаяТаблицаПравил.Строки[0].Строки Цикл
					Если СтрокаУровня.Включить = 1 И не СтрокаУровня.ЭтоГруппа тогда
						СтрокаУровня.СсылкаНаУзелОбмена = УзелОбмена;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если ПервыйУровень.Включить = 1 тогда
					СтрокаУровня.СсылкаНаУзелОбмена = УзелОбмена;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Обработка.ТаблицаПравилВыгрузки = ВременнаяТаблицаПравил.Скопировать();
		
		Обработка.ВыполнитьВыгрузку();
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ФайлОбмена);
		ДвоичныеДанные.Записать(ФайлОбмена);
		
		ПереместитьФайл(ФайлОбмена, ФайлЗагрузки);
		
	Исключение
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,, "Произошла ошибка при выгрузке в ERP", ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры
